vittali/vittali.ch-5-TIR-1002-tidc01002/examples/cc3220sf_gateway_app/15_4_Stack_Gtway_CC3220SF_LAUNCHXL_tirtos_ccs/CloudService/IBM/cloudServiceIBM.c
/*
 * Copyright (c) 2016, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 *
 *  Created on: Feb 16, 2017
 *      Author: a0226081
 *
 *
 */

/*****************************************************************************

 Application Name     -   MQTT Client
 Application Overview -   The device is running a MQTT client which is
                           connected to the online broker. The Red LED on the
                           device can be controlled from a web client by
                           publishing msg on appropriate topics. Similarly,
                           message are being published on pre-configured topics
                           every second.

 Application Details  - Refer to 'MQTT Client' README.html

 *****************************************************************************/
//*****************************************************************************
//
//! \addtogroup mqtt_server
//! @{
//
//*****************************************************************************
/* Standard includes                                                          */
#include <string.h>
#include <stdlib.h>
#include <stdio.h>
#include <unistd.h>
#include <pthread.h>
#include <mqueue.h>
#include <time.h>

/* Hardware includes                                                          */
#include <ti/devices/cc32xx/inc/hw_types.h>
#include <ti/devices/cc32xx/inc/hw_ints.h>
#include <ti/devices/cc32xx/inc/hw_memmap.h>

/* Driverlib includes                                                         */
#include <ti/devices/cc32xx/driverlib/rom.h>
#include <ti/devices/cc32xx/driverlib/rom_map.h>
#include <ti/devices/cc32xx/driverlib/timer.h>

/* TI-Driver includes                                                         */
#include <ti/drivers/GPIO.h>
#include <ti/drivers/SPI.h>
#include <ti/sysbios/posix/_time.h>

/* Simplelink includes                                                        */
#include <ti/drivers/net/wifi/simplelink.h>

/* MQTT Library includes                                                      */
#include <ti/net/mqtt/mqtt_client.h>
#include <ti/net/mqtt/mqtt_server.h>

/* Common interface includes                                                  */
#include <Common/uart_term.h>
#include <Common/commonDefs.h>

/* Application includes                                                       */
#include <Common/Board.h>
#include <CloudService/cloudJson.h>
#include "cloudServiceIBM.h"

//*****************************************************************************
//                          LOCAL DEFINES
//*****************************************************************************

#define CLIENT_INIT_STATE       (0x01)
#define SERVER_INIT_STATE       (0x02)
#define MQTT_INIT_STATE         (0x04)


/* Operate Lib in MQTT 3.1 mode.                                              */
#define MQTT_3_1_1              false
#define MQTT_3_1                true

#define WILL_TOPIC              "Client"
#define WILL_MSG                "Client Stopped"
#define WILL_QOS                MQTT_QOS_0
#define WILL_RETAIN             false


#define PORT_NUMBER             1883
#define SECURED_PORT_NUMBER     8883
#define LOOPBACK_PORT           1882

/* Clean session flag                                                         */
#define CLEAN_SESSION           true

/* Retain Flag. Used in publish message.                                      */
#define RETAIN                  1

/* Defining Number of topics                                                  */
#define SUB_TOPIC_COUNT         1

/* Defining Subscription Topic Values                                         */
#define TOPIC0                  "iot-2/type/+/id/+/cmd/+/fmt/json"

/* Spawn task priority and Task and Thread Stack Size                         */

#define RXTASKSIZE              4096

/* secured client requires time configuration, in order to verify server      */
/* certifcate validiy (date).                                                 */

/* Day of month (DD format) range 1-31                                        */
#define DAY                     8
/* Month (MM format) in the range of 1-12                                     */
#define MONTH                   2
/* Year (YYYY format)                                                         */
#define YEAR                    2017
/* Hours in the range of 0-23                                                 */
#define HOUR                    12
/* Minutes in the range of 0-59                                               */
#define MINUTES                 35
/* Seconds in the range of 0-59                                               */
#define SEC                     00

#define TOPICS_NUM 3
#define MAX_TOPIC_LEN 100
char topicList[TOPICS_NUM][MAX_TOPIC_LEN];
char *topicStrings[TOPICS_NUM] = {"nwkUpdate", "permitJoinCnf", "deviceUpdate"};
typedef enum
{
    MqttTopicIBM_NWK_UPDT,
    MqttTopicIBM_STATE_UPDT,
    MqttTopicIBM_DEV_UPDT,
}MqttTopic;

const char topicBaseStr[] = "iot-2/type/%s/id/%s/evt/%s/fmt/json";
const char clienIdBaseStr[] = "g:%s:%s:%s";
const char srvrBaseStr[] = "%s.messaging.internetofthings.ibmcloud.com";
char topicList[TOPICS_NUM][MAX_TOPIC_LEN];
#define CLIENTID_MAX_LEN 128
#define IBM_SRVR_ADDR_MAC_LEN 70
char ClientId[CLIENTID_MAX_LEN];
char IBMServerAddress[IBM_SRVR_ADDR_MAC_LEN];


