vittali/vittali.ch-5-TIR-1002-tidc01002/examples/cc3220sf_gateway_app/15_4_Stack_Gtway_CC3220SF_LAUNCHXL_tirtos_ccs/CloudService/IBM/cloudServiceIBM.c
const char *incomingDevCmds[] =
{
 "updateFanSpeed",
 "sendToggle",
 "updateDoorLock"
};
const CmdTypes incomingDevCmdTypes[] =
{
 CmdType_FAN_DATA,
 CmdType_LED_DATA,
 CmdType_DOORLOCK_DATA
};

//*****************************************************************************
//                      LOCAL FUNCTION PROTOTYPES
//*****************************************************************************

static void cloudIBM_stop();
int32_t cloudIBM_startMqttCli();
static void cloudIBM_mqttClientCb(int32_t event , void * metaData , uint32_t metaDateLen , void *data , uint32_t dataLen);


//*****************************************************************************
//                 GLOBAL VARIABLES
//*****************************************************************************




static NetAppHandle_t gMqttClient;
MQTTClient_Attrib_t  cloudIBM_mqttParams;

/* Receive task handle                                                        */
pthread_t g_rx_task_hndl = (pthread_t) NULL;

/* Client ID,User Name and Password                                           */
#define CLNT_USR_PWD

/* Subscription topics and qos values                                         */

MQTTClient_SubscribeParams_t subInfo[SUB_TOPIC_COUNT] = {{
    TOPIC0,
    NULL,
    MQTT_QOS_0,
    NULL}
};


/* Message Queue                                                              */
mqd_t cloudSrvrMq;
mqd_t disconnectedMq;
mqd_t *gatewayMq;
CloudIBM_Info_t *cloudConnectionInfo;
bool wlanConnected = false;
bool ibmCloudConnected = false;

char *IBMMqttUsername = "use-token-auth";



/* enables secured client                                                     */
//#define SECURE_CLIENT

#ifdef  SECURE_CLIENT

#define CLIENT_NUM_SECURE_FILES 4
char *Mqtt_Client_secure_files[CLIENT_NUM_SECURE_FILES] = {"/cert/index4.key.pem","/cert/index4.cert.pem","/cert/ca.cert.pem",NULL};

/* Initialization structure to be used with sl_ExtMqtt_Init API. In order to  */
/* use secured socket method, cipher, n_files and secure_files must be        */
/* configured. certifcates also must be programmed  ("ca-cert.pem").          */
MQTTClient_NetAppConnParams_t Mqtt_ClientCtx =
{
     MQTTCLIENT_NETCONN_SEC,
     SERVER_ADDRESS, //SERVER_ADDRESS,
     SECURED_PORT_NUMBER,//  PORT_NUMBER,
     SL_SO_SEC_METHOD_TLSV1,
     SL_SEC_MASK_SECURE_DEFAULT,
     0,
     NULL
};

void setTime()
{
    SlDateTime_t dateTime = {0};
    dateTime.tm_day = (uint32_t)DAY;
    dateTime.tm_mon = (uint32_t)MONTH;
    dateTime.tm_year = (uint32_t)YEAR;
    dateTime.tm_hour = (uint32_t)HOUR;
    dateTime.tm_min = (uint32_t)MINUTES;
    dateTime.tm_sec = (uint32_t)SEC;
    sl_DeviceSet(SL_DEVICE_GENERAL, SL_DEVICE_GENERAL_DATE_TIME, sizeof(SlDateTime_t), (uint8_t *)(&dateTime));
}
#else


#endif

MQTTClient_Will_t will_param =
{
    WILL_TOPIC,
    WILL_MSG,
    WILL_QOS,
    WILL_RETAIN
};



void *cloudIBM_MqttClientThread(void * pvParameters)
{
    //msgQueue_t queueElement;

    MQTTClient_run((NetAppHandle_t)pvParameters);

    //queueElement.event = CommonEvent_CLOUD_SERV_DISCONNECTED;
    //queueElement.msgPtr = NULL;
    UART_PRINT("[Cloud Service] MQTT CLIENT disconnected, exit pthread\n\r");
    /* write message indicating disconnect Broker message.                    */
    //mq_send(cloudSrvrMq, (char*) &queueElement, sizeof(msgQueue_t), 0);

    pthread_exit(0);

    return NULL;
}

/*!
 Register the message queue

 Public function defined in cloudService.h
 */
void cloudIBM_registerCliMq(mqd_t *pGatewayMq)
{
    gatewayMq = pGatewayMq;
}

/*!
 Initialize the IBM client

 Public function defined in cloudService.h
 */
void cloudIBM_init(const char *cloudSrvrMqName)
{
    mq_attr attr;
    unsigned mode = 0;

    attr.mq_maxmsg = 20;
    attr.mq_msgsize = sizeof(msgQueue_t);
    disconnectedMq = mq_open("disconnectedMQ", O_CREAT | O_NONBLOCK, mode, &attr);
    cloudSrvrMq = mq_open(cloudSrvrMqName, O_WRONLY );//| O_NONBLOCK);

    if (cloudSrvrMq == NULL)
    {
        UART_PRINT("[Cloud Service] MQTT Message Queue create fail\n\r");
    }
}

/*!
 Register the cloud Info

 Public function defined in cloudService.h
 */
void cloudIBM_registerCloudInfo(CloudIBM_Info_t *cInfo)
{
    if(cloudConnectionInfo)
    {
        free(cloudConnectionInfo->devId);
        free(cloudConnectionInfo->devType);
        free(cloudConnectionInfo->orgId);
        free(cloudConnectionInfo->securityToken);
        free(cloudConnectionInfo);
    }
    cloudConnectionInfo = cInfo;
}

/*!
 Start the cloud client

 Public function defined in cloudService.h
 */
void cloudIBM_start()
{
    if(wlanConnected && !ibmCloudConnected && cloudConnectionInfo)
    {
        ibmCloudConnected = (cloudIBM_startMqttCli() == 0);
        if(ibmCloudConnected)
        {
            msgQueue_t mqEvt = {CommonEvent_CLOUD_SERV_CONNECTED, NULL, 0};
            mq_send(cloudSrvrMq, (char*)&mqEvt, sizeof(msgQueue_t), MQ_LOW_PRIOR);
        }
    }
}


/*!
 Start the IBM mqtt client

 Public function defined in cloudService.h
 */
int32_t cloudIBM_startMqttCli()
{
    int32_t lRetVal = -1;
    int32_t threadArg = 100;
    pthread_attr_t pAttrs;
    struct sched_param priParam;

    UART_PRINT("\n\r");
    for(uint16_t topicIdx = 0; topicIdx < TOPICS_NUM; topicIdx++)
    {
        snprintf(topicList[topicIdx], MAX_TOPIC_LEN - 1, topicBaseStr,
                 cloudConnectionInfo->devType,
                 cloudConnectionInfo->devId,
                 topicStrings[topicIdx]);
        UART_PRINT("\n\r[Cloud Service] TOPIC# %d: %s\n\r", topicIdx, topicList[topicIdx]);
    }

    snprintf(ClientId, CLIENTID_MAX_LEN,clienIdBaseStr,
             cloudConnectionInfo->orgId,
             cloudConnectionInfo->devType,
             cloudConnectionInfo->devId);

    snprintf(IBMServerAddress, IBM_SRVR_ADDR_MAC_LEN, srvrBaseStr, cloudConnectionInfo->orgId);
    UART_PRINT("[Cloud Service] CLIENT ID: %s\n\r", ClientId);
    UART_PRINT("[Cloud Service] SERVER ADDRESS: %s\n\n\r", IBMServerAddress);

    MQTTClient_NetAppConnParams_t Mqtt_ClientCtx =
    {
        MQTTCLIENT_NETCONN_URL,
        IBMServerAddress,
        PORT_NUMBER, 0, 0, 0,
        NULL
    };

    /* Initialze MQTT client lib                                              */
    cloudIBM_mqttParams.clientId = ClientId;
    cloudIBM_mqttParams.connParams = &Mqtt_ClientCtx;
    cloudIBM_mqttParams.mqttMode31 = MQTT_3_1;
    cloudIBM_mqttParams.blockingSend = true;

    gMqttClient = MQTTClient_create(cloudIBM_mqttClientCb, &cloudIBM_mqttParams);

    if( gMqttClient == NULL )
    {
        /* lib initialization failed                                          */
        return -1;
    }

    /* Open Client Receive Thread start the receive task. Set priority and    */
    /* stack size attributes                                                  */
    pthread_attr_init(&pAttrs);
    priParam.sched_priority = 2;
    lRetVal = pthread_attr_setschedparam(&pAttrs, &priParam);
    lRetVal |= pthread_attr_setstacksize(&pAttrs, RXTASKSIZE);
    lRetVal |= pthread_attr_setdetachstate(&pAttrs, PTHREAD_CREATE_DETACHED);
    lRetVal |= pthread_create(&g_rx_task_hndl, &pAttrs, cloudIBM_MqttClientThread, (void *) &threadArg);

    if (lRetVal != 0)
    {
        UART_PRINT("[Cloud Service] Client Thread Create Failed failed\n\r");
        return -1;
    }

/*setting date and time for secure client                                 */
#ifdef SECURE_CLIENT
    setTime();
#endif

/* setting will parameters                                                */
#ifdef WILL_PARAM
    MQTTClient_set(gMqttClient, MQTT_CLIENT_WILL_PARAM, &will_param, sizeof(will_param));
#endif

