vittali/vittali.ch-5-TIR-1002-tidc01002/examples/cc3220sf_gateway_app/15_4_Stack_Gtway_CC3220SF_LAUNCHXL_tirtos_ccs/CloudService/IBM/cloudServiceIBM.c
#ifdef CLNT_USR_PWD
    /* Set username for client connection                                     */
    MQTTClient_set(gMqttClient, MQTT_CLIENT_USER_NAME, IBMMqttUsername, strlen((char*)IBMMqttUsername));

    /* Set password                                                           */
    MQTTClient_set(gMqttClient, MQTT_CLIENT_PASSWORD, cloudConnectionInfo->securityToken, strlen(cloudConnectionInfo->securityToken));
#endif
    /* Initiate MQTT Connect                                                  */
    {
#if CLEAN_SESSION == true
        bool clean = CLEAN_SESSION;
        lRetVal |= MQTTClient_set(gMqttClient, MQTT_CLIENT_CLEAN_CONNECT, &clean, sizeof(bool));
#endif

        lRetVal |= MQTTClient_connect(gMqttClient);

        if (lRetVal != 0)
        {
            /* lib initialization failed                                      */
            UART_PRINT("[Cloud Service] Connection to broker failed\n\r, ERRORNUM: %d", lRetVal);
            return (-1);
        }
        /* Subscribe to topics                                                */
        if (MQTTClient_subscribe(gMqttClient , subInfo, SUB_TOPIC_COUNT) < 0)
        {
            UART_PRINT("\n\r [Cloud Service] Subscription Error \n\r");
            MQTTClient_disconnect(gMqttClient);
            return -1;
        }
    }

    return 0;
}

/*!
 Stop the IBM Client

 Public function defined in cloudService.h
 */
void cloudIBM_stop()
{
    int16_t ret = -1;
    MQTTClient_UnsubscribeParams_t unsubInfo[SUB_TOPIC_COUNT];
    if(ibmCloudConnected)
    {
        for(uint8_t unsubIdx = 0; unsubIdx < SUB_TOPIC_COUNT; unsubIdx++ )
        {
            unsubInfo[unsubIdx].topic = subInfo[unsubIdx].topic;
        }

        ret = MQTTClient_unsubscribe(gMqttClient , unsubInfo, SUB_TOPIC_COUNT);

        if(ret != 0)
        {
            UART_PRINT("[Cloud Service] ERROR UNSUBSCRIBING FROM TOPICS\n\r");
        }
        /* exiting the Client library                                             */
        ret = MQTTClient_delete(gMqttClient);
        if(ret != 0)
        {
            UART_PRINT("[Cloud Service] ERROR DELETING CONTEXT\n\r");
        }
        ibmCloudConnected = false;
    }


}


void CloudIBM_handleWlanDisconnect()
{
    wlanConnected = false;
}
void CloudIBM_handleWlanConnect()
{
    wlanConnected = true;
}
void CloudIBM_handleCloudDisconnect()
{
    cloudIBM_stop();
    cloudIBM_start();
}
void CloudIBM_handleCloudConnect(void)
{
    uint8_t timeout = 20;
    msgQueue_t queueElemRecv;
    // flush all queued msgs accumulated while cloud was disconnected
    while(mq_receive(disconnectedMq, (char*) &queueElemRecv, sizeof(msgQueue_t), NULL) > 0 && timeout--)
    {
        CloudIBM_handleGatewayEvt(&queueElemRecv);
        if(queueElemRecv.msgPtr)
        {
            free(queueElemRecv.msgPtr);
            queueElemRecv.msgPtr = NULL;
        }
    }
}
void CloudIBM_handleGatewayEvt(msgQueue_t *inEvtMsg)
{
    if(ibmCloudConnected)
    {
        char *tmpBuff;
        char *tmpTopic = NULL;
        tmpBuff = (char*) inEvtMsg->msgPtr;
        switch(inEvtMsg->event)
        {
        case CloudServiceEvt_NWK_UPDATE:
            tmpTopic = topicList[MqttTopicIBM_NWK_UPDT];
            break;

        case CloudServiceEvt_DEV_UPDATE:
            tmpTopic = topicList[MqttTopicIBM_DEV_UPDT];
            break;

        case CloudServiceEvt_STATE_CNF_EVT:
            tmpTopic = topicList[MqttTopicIBM_NWK_UPDT];
            MQTTClient_publish(gMqttClient, tmpTopic,
                                     strlen(tmpTopic),
                                     tmpBuff,
                                     strlen(tmpBuff),
                                     MQTT_QOS_0 | MQTT_PUBLISH_RETAIN );

            UART_PRINT("\n\r [Cloud Service] CC3200 Publishes the following message \n\r");
            UART_PRINT("\tTopic: %s\n\r", tmpTopic);
            UART_PRINT("\tData: %s\n\r", tmpBuff);
            tmpTopic = topicList[MqttTopicIBM_STATE_UPDT];
           break;
        }
        if(tmpTopic)
        {
            MQTTClient_publish(gMqttClient, tmpTopic,
                                     strlen(tmpTopic),
                                     tmpBuff,
                                     strlen(tmpBuff),
                                     MQTT_QOS_0 | MQTT_PUBLISH_RETAIN );

            UART_PRINT("\n\r [Cloud Service] CC3200 Publishes the following message \n\r");
            UART_PRINT("\tTopic: %s\n\r", tmpTopic);
            UART_PRINT("\tData: %s\n\r", tmpBuff);
        }
    }
    else
    {
        char *buf = (char*)malloc(inEvtMsg->msgPtrLen);
        memcpy(buf, inEvtMsg->msgPtr, inEvtMsg->msgPtrLen);
        msgQueue_t mqEvt = {inEvtMsg->event, buf, inEvtMsg->msgPtrLen};
        if(mq_send(disconnectedMq, (char*) &mqEvt, sizeof(msgQueue_t), 0) != 0)
        {
            free(buf);
        }
    }
}


/*!
 Parse the received message from the cloud

 Public function defined in cloudService.h
 */
void CloudIBM_handleCloudEvt(msgQueue_t *inEvtMsg)
{
    char *extractedJson;
    char *tmpBuff;
    deviceCmd_t *inCommand;
    msgQueue_t queueElementSend;
    inCommand = malloc(sizeof(deviceCmd_t));
    inCommand->cmdType = 0xFFFF;



    tmpBuff = (char *) ((uint8_t *) inEvtMsg->msgPtr +
                    (sizeof(struct publishMsgHeader)) +
                    ((struct publishMsgHeader*)inEvtMsg->msgPtr)->topicLen) + 1;


    extractedJson = jsonParseIn(tmpBuff, "dstAddr");
    if(extractedJson)
    {
        int shortAddr;
        inCommand->cmdType = CmdType_DEVICE_DATA;
        queueElementSend.event = GatewayEvent_DEVICE_CMD;
        sscanf(extractedJson, "%x", &shortAddr);
        inCommand->shortAddr = shortAddr;

        extractedJson = jsonParseIn(tmpBuff, "devActionType");
        if(extractedJson)
        {
            for(uint8_t cmds = 0; cmds < sizeof(incomingDevCmds); cmds++)
            {
                if(strncmp(extractedJson, incomingDevCmds[cmds], strlen(incomingDevCmds[cmds])) == 0)
                {
                    inCommand->cmdType = incomingDevCmdTypes[cmds];
                    break;
                }
            }
        }
        extractedJson = jsonParseIn(tmpBuff, "value");
        if(extractedJson)
        {
            inCommand->data = atoi(extractedJson);
        }
    }

    extractedJson = jsonParseIn(tmpBuff, "action");
    if(extractedJson)
    {
        queueElementSend.event = GatewayEvent_PERMIT_JOIN;
        inCommand->cmdType = CmdType_PERMIT_JOIN;
        inCommand->data = atoi(extractedJson);
    }
    queueElementSend.msgPtr = inCommand;

    /* send message to gateway task for processing */
    if(mq_send(*gatewayMq, (char*) &queueElementSend, sizeof(msgQueue_t), 0) != 0)
    {
        free(inCommand);
    }
}




//****************************************************************************
//
//! Callback in case of various event (for clients connection with remote
//! broker)
//!
//! \param[in]  app_hndl    - is the ctx handl for the connection
//! \param[in]  evt         - is a event occured
//! \param[in]  buff        - is the pointer to the buffer for data
//!                           (for this event)
//! \param[in]  len         - is the length of the buffer data
//!
//! return none
//
//****************************************************************************
void cloudIBM_mqttClientCb(int32_t event , void * metaData , uint32_t metaDateLen , void *data , uint32_t dataLen)
{
    switch((MQTTClient_EventCB)event)
    {
        case MQTT_CLIENT_OPERATION_CB_EVENT:
        {
            switch (((MQTTClient_OperationMetaDataCB_t*)metaData)->messageType)
            {
                case MQTTCLIENT_OPERATION_EVT_PUBACK:
                    UART_PRINT("PubAck:\n\r");
                    UART_PRINT("%s\n\r", data);
                    break;

                case MQTTCLIENT_OPERATION_SUBACK:
                    UART_PRINT("Sub Ack:\n\r");
                    break;
                case MQTTCLIENT_OPERATION_UNSUBACK:
                    UART_PRINT("UnSub Ack \n\r");
                    UART_PRINT("%s\n\r", data);
                    break;

                default:
                    break;
            }
        }
            break;
        case MQTT_CLIENT_RECV_CB_EVENT:
        {
            MQTTClient_RecvMetaDataCB_t *recvMetaData =  (MQTTClient_RecvMetaDataCB_t *)metaData;
            uint32_t bufSizeReqd = 0;
            uint32_t topicOffset;
            uint32_t payloadOffset;

            struct publishMsgHeader msgHead;

            char *pubBuff = NULL;

            topicOffset = sizeof(struct publishMsgHeader);
            payloadOffset = sizeof(struct publishMsgHeader) + recvMetaData->topLen + 1;

            bufSizeReqd += sizeof(struct publishMsgHeader);
            bufSizeReqd += recvMetaData->topLen + 1;
            bufSizeReqd += dataLen + 1;
            pubBuff = (char *) malloc(bufSizeReqd);

            if (pubBuff == NULL)
            {
                //pubBuff = (char *) malloc(bufSizeReqd);
                UART_PRINT("malloc failed: recv_cb\n\r");
                return;
            }

            msgHead.topicLen = recvMetaData->topLen;
            msgHead.payLen = dataLen;
            msgHead.retain = recvMetaData->retain;
            msgHead.dup = recvMetaData->dup;
            msgHead.qos = recvMetaData->qos;
            memcpy((void*) pubBuff, &msgHead, sizeof(struct publishMsgHeader));

            /* copying the topic name into the buffer                         */
            memcpy((void*) (pubBuff + topicOffset), (const void*)recvMetaData->topic, recvMetaData->topLen);
            memset((void*) (pubBuff + topicOffset + recvMetaData->topLen), '\0', 1);

            /* copying the payload into the buffer                            */
            memcpy((void*) (pubBuff + payloadOffset), (const void*) data, dataLen);
            memset((void*) (pubBuff + payloadOffset + dataLen), '\0', 1);

            UART_PRINT("\n\rMsg Recvd. by client\n\r");
            UART_PRINT("TOPIC: %s\n\r", recvMetaData->topic);
            UART_PRINT("PAYLOAD: %s\n\r", pubBuff + payloadOffset);
            UART_PRINT("QOS: %d\n\r", recvMetaData->qos);

            if (recvMetaData->retain)
            {
                UART_PRINT("Retained\n\r");
            }

            if (recvMetaData->dup)
            {
                UART_PRINT("Duplicate\n\r");
            }

            msgQueue_t mqEvt = {CloudServiceEvt_CLOUD_IN_MQTT, pubBuff, recvMetaData->topLen};
            mq_send(cloudSrvrMq, (char*)&mqEvt, sizeof(msgQueue_t), MQ_LOW_PRIOR);
        }
            break;
        case MQTT_CLIENT_DISCONNECT_CB_EVENT:
        {
            msgQueue_t mqEvt = {CommonEvent_CLOUD_SERV_DISCONNECTED, NULL, 0};
            mq_send(cloudSrvrMq, (char*)&mqEvt, sizeof(msgQueue_t), MQ_LOW_PRIOR);
            UART_PRINT("BRIDGE DISCONNECTION\n\r");
        }
            break;
    }

}



//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************
